# Advanced Aggregates

Please remember to use the `EXPLAIN` before you execute a query to help avoid unnecessary load on the DBMS and indefinite waits by you for results.

Therefore, for each question, we are providing a cell for the `EXPLAIN` as well as the final SQL.


## Our practice schema:

We will use the DVD Rental database.

A PDF of the _Entity-Relationship Diagrams_ (ERD) is available [here](https://web.dsa.missouri.edu/static/PDF/DVD_Rental_ERD2.pdf).   
Printing it out is recommended.


**NOTE**: These queries are more complex that the others.
If you get stuck on one, skip and come back to it later.

**NOTE**: For this notebook, it is desired that you construct solutions using advanced aggregates and derived tables.

In [1]:
%load_ext sql
%sql postgres://dsa_ro_user:readonly@pgsql.dsa.lan/dvdrental

'Connected: dsa_ro_user@dvdrental'

### 1
### What is the average, variance, and standard deviation of the film length?

In [2]:
%%sql
EXPLAIN
SELECT  avg(length)
        ,variance(length)
        ,stddev(length)
FROM    film;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
2 rows affected.

[('Aggregate  (cost=71.51..71.52 rows=1 width=96)',),
 ('  ->  Seq Scan on film  (cost=0.00..64.00 rows=1000 width=2)',)]

In [3]:
%%sql
SELECT  avg(length)
        ,variance(length)
        ,stddev(length)
FROM    film;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
1 rows affected.

[(Decimal('115.2720000000000000'), Decimal('1634.2883043043043043'), Decimal('40.4263318185598470'))]

### 2
### What is the average, variance, and standard deviation of the film length; broken down by film category.

In [4]:
%%sql
EXPLAIN
SELECT  ca.name
        ,avg(f.length)
        ,variance(f.length)
        ,stddev(f.length)
FROM    film f JOIN film_category fc
        USING(film_id)
        JOIN category ca
        USING(category_id)
GROUP BY ca.name;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
11 rows affected.

[('HashAggregate  (cost=109.81..110.09 rows=16 width=164)',),
 ('  Group Key: ca.name',),
 ('  ->  Hash Join  (cost=77.86..99.81 rows=1000 width=70)',),
 ('        Hash Cond: (fc.category_id = ca.category_id)',),
 ('        ->  Hash Join  (cost=76.50..95.14 rows=1000 width=4)',),
 ('              Hash Cond: (fc.film_id = f.film_id)',),
 ('              ->  Seq Scan on film_category fc  (cost=0.00..16.00 rows=1000 width=4)',),
 ('              ->  Hash  (cost=64.00..64.00 rows=1000 width=6)',),
 ('                    ->  Seq Scan on film f  (cost=0.00..64.00 rows=1000 width=6)',),
 ('        ->  Hash  (cost=1.16..1.16 rows=16 width=72)',),
 ('              ->  Seq Scan on category ca  (cost=0.00..1.16 rows=16 width=72)',)]

In [5]:
%%sql
SELECT  ca.name
        ,avg(f.length)
        ,variance(f.length)
        ,stddev(f.length)
FROM    film f JOIN film_category fc
        USING(film_id)
        JOIN category ca
        USING(category_id)
GROUP BY ca.name;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
16 rows affected.

[('Family', Decimal('114.7826086956521739'), Decimal('1523.2314578005115090'), Decimal('39.0285979481778401')),
 ('Games', Decimal('127.8360655737704918'), Decimal('1262.4726775956284153'), Decimal('35.5312915272668975')),
 ('Animation', Decimal('111.0151515151515152'), Decimal('1723.0920745920745921'), Decimal('41.5101442371870661')),
 ('Classics', Decimal('111.6666666666666667'), Decimal('1475.2261904761904762'), Decimal('38.4086733756347080')),
 ('Documentary', Decimal('108.7500000000000000'), Decimal('1814.6679104477611940'), Decimal('42.5989191229984284')),
 ('New', Decimal('111.1269841269841270'), Decimal('1514.7900665642601126'), Decimal('38.9203040399771301')),
 ('Sports', Decimal('128.2027027027027027'), Decimal('1796.4651980747871159'), Decimal('42.3847283591010775')),
 ('Children', Decimal('109.8000000000000000'), Decimal('1500.9084745762711864'), Decimal('38.7415600431406374')),
 ('Music', Decimal('113.6470588235294118'), Decimal('1787.3129411764705882'), Decimal('42.2766240513178936')),
 ('Travel', Decimal('113.3157894736842105'), Decimal('1540.1842105263157895'), Decimal('39.2451807299484326')),
 ('Foreign', Decimal('121.6986301369863014'), Decimal('1861.9079147640791476'), Decimal('43.1498309934590491')),
 ('Drama', Decimal('120.8387096774193548'), Decimal('1658.3997884717080910'), Decimal('40.7234550163871544')),
 ('Horror', Decimal('112.4821428571428571'), Decimal('1388.6905844155844156'), Decimal('37.2651389963271761')),
 ('Action', Decimal('111.6093750000000000'), Decimal('1848.3687996031746032'), Decimal('42.9926598340132313')),
 ('Sci-Fi', Decimal('108.1967213114754098'), Decimal('1315.6273224043715847'), Decimal('36.2715773354891693')),
 ('Comedy', Decimal('115.8275862068965517'), Decimal('1781.3381730187537810'), Decimal('42.2059021111829072'))]

[Helpful Hints Video](https://youtu.be/jy9H2KLI4Iw)

### 3
### A movie's "cumulative rented duration" is the sum of all rentals from rental table.  What is the average _cumulative rented duration_ per store (inventory.store_id).

In [15]:
%%sql
EXPLAIN
SELECT  s.store_id, avg(cumulative_rentals.cumulative_duration)
FROM    store s JOIN staff st
        USING(store_id)
        JOIN rental r
        USING(staff_id)
        JOIN (SELECT  inventory_id
                    ,sum(r.return_date - r.rental_date) AS cumulative_duration
            FROM    rental as r
            WHERE   r.return_date IS NOT NULL
            GROUP BY r.inventory_id
        ) as cumulative_rentals
        ON r.inventory_id = cumulative_rentals.inventory_id
GROUP BY s.store_id;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
19 rows affected.

[('HashAggregate  (cost=1233.79..1233.82 rows=2 width=20)',),
 ('  Group Key: s.store_id',),
 ('  ->  Hash Join  (cost=580.37..1153.57 rows=16044 width=20)',),
 ('        Hash Cond: (r.inventory_id = cumulative_rentals.inventory_id)',),
 ('        ->  Hash Join  (cost=2.12..533.17 rows=16044 width=8)',),
 ('              Hash Cond: (r.staff_id = st.staff_id)',),
 ('              ->  Seq Scan on rental r  (cost=0.00..310.44 rows=16044 width=6)',),
 ('              ->  Hash  (cost=2.09..2.09 rows=2 width=8)',),
 ('                    ->  Nested Loop  (cost=0.00..2.09 rows=2 width=8)',),
 ('                          Join Filter: (s.store_id = st.store_id)',),
 ('                          ->  Seq Scan on staff st  (cost=0.00..1.02 rows=2 width=6)',),
 ('                          ->  Materialize  (cost=0.00..1.03 rows=2 width=4)',),
 ('                                ->  Seq Scan on store s  (cost=0.00..1.02 rows=2 width=4)',),
 ('        ->  Hash  (cost=521.00..521.00 rows=4580 width=20)',),
 ('              ->  Subquery Scan on cumulative_rentals  (cost=429.40..521.00 rows=4580 width=20)',),
 ('                    ->  HashAggregate  (cost=429.40..475.20 rows=4580 width=20)',),
 ('                          Group Key: r_1.inventory_id',),
 ('                          ->  Seq Scan on rental r_1  (cost=0.00..310.44 rows=15861 width=20)',),
 ('                                Filter: (return_date IS NOT NULL)',)]

In [16]:
%%sql
SELECT  s.store_id, avg(cumulative_rentals.cumulative_duration)
FROM    store s JOIN staff st
        USING(store_id)
        JOIN rental r
        USING(staff_id)
        JOIN (SELECT  inventory_id
                    ,sum(r.return_date - r.rental_date) AS cumulative_duration
            FROM    rental as r
            WHERE   r.return_date IS NOT NULL
            GROUP BY r.inventory_id
        ) as cumulative_rentals
        ON r.inventory_id = cumulative_rentals.inventory_id
GROUP BY s.store_id;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
2 rows affected.

[(1, datetime.timedelta(days=19, seconds=16973, microseconds=873135)),
 (2, datetime.timedelta(days=19, seconds=12363, microseconds=770615))]

[Helpful Hints Video](https://youtu.be/Scyn7exzUcY)

### 4
### Which three categories of film have the highest average number of actors per film?

In [32]:
%%sql
EXPLAIN
SELECT  c.name, avg(ac.actors) as avg_actors
FROM    category c JOIN film_category fc
        USING(category_id)
        JOIN film f
        USING(film_id)
        JOIN (SELECT  film_id, COUNT(actor_id) as actors
              FROM    film_actor
              GROUP BY film_id
        ) as ac
        USING(film_id)
GROUP BY c.name
ORDER BY avg_actors DESC
LIMIT   3;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
21 rows affected.

[('Limit  (cost=252.16..252.16 rows=3 width=100)',),
 ('  ->  Sort  (cost=252.16..252.20 rows=16 width=100)',),
 ('        Sort Key: (avg(ac.actors)) DESC',),
 ('        ->  HashAggregate  (cost=251.75..251.95 rows=16 width=100)',),
 ('              Group Key: c.name',),
 ('              ->  Hash Join  (cost=222.19..246.76 rows=997 width=76)',),
 ('                    Hash Cond: (fc.film_id = f.film_id)',),
 ('                    ->  Hash Join  (cost=145.69..167.64 rows=997 width=80)',),
 ('                          Hash Cond: (fc.category_id = c.category_id)',),
 ('                          ->  Hash Join  (cost=144.33..162.97 rows=997 width=14)',),
 ('                                Hash Cond: (fc.film_id = ac.film_id)',),
 ('                                ->  Seq Scan on film_category fc  (cost=0.00..16.00 rows=1000 width=4)',),
 ('                                ->  Hash  (cost=131.87..131.87 rows=997 width=10)',),
 ('                                      ->  Subquery Scan on ac  (cost=111.93..131.87 rows=997 width=10)',),
 ('                                            ->  HashAggregate  (cost=111.93..121.90 rows=997 width=10)',),
 ('                                                  Group Key: film_actor.film_id',),
 ('                                                  ->  Seq Scan on film_actor  (cost=0.00..84.62 rows=5462 width=4)',),
 ('                          ->  Hash  (cost=1.16..1.16 rows=16 width=72)',),
 ('                                ->  Seq Scan on category c  (cost=0.00..1.16 rows=16 width=72)',),
 ('                    ->  Hash  (cost=64.00..64.00 rows=1000 width=4)',),
 ('                          ->  Seq Scan on film f  (cost=0.00..64.00 rows=1000 width=4)',)]

In [33]:
%%sql
SELECT  c.name, avg(ac.actors) as avg_actors
FROM    category c JOIN film_category fc
        USING(category_id)
        JOIN film f
        USING(film_id)
        JOIN (SELECT  film_id, COUNT(actor_id) as actors
              FROM    film_actor
              GROUP BY film_id
        ) as ac
        USING(film_id)
GROUP BY c.name
ORDER BY avg_actors DESC
LIMIT   3;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
3 rows affected.

[('Sports', Decimal('6.0410958904109589')),
 ('Drama', Decimal('5.7377049180327869')),
 ('Children', Decimal('5.7333333333333333'))]

### 5
### For each staff member, list their average daily payment amount processed.

In [42]:
%%sql
EXPLAIN
SELECT  staff_id, avg(payments.daily_payments) as avg_daily_payments
FROM    staff st JOIN (
            SELECT  staff_id
                    ,payment_date::TIMESTAMP::DATE as date
                    ,sum(amount) as daily_payments
            FROM    payment
            GROUP BY staff_id, date
        ) as payments
        USING(staff_id)
GROUP BY staff_id;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
11 rows affected.

[('GroupAggregate  (cost=803.76..804.87 rows=2 width=36)',),
 ('  Group Key: st.staff_id',),
 ('  ->  Sort  (cost=803.76..804.12 rows=144 width=36)',),
 ('        Sort Key: st.staff_id',),
 ('        ->  Hash Join  (cost=400.96..798.60 rows=144 width=36)',),
 ('              Hash Cond: (payment.staff_id = st.staff_id)',),
 ('              ->  HashAggregate  (cost=399.92..615.40 rows=14365 width=38)',),
 ('                    Group Key: payment.staff_id, (payment.payment_date)::date',),
 ('                    ->  Seq Scan on payment  (cost=0.00..290.45 rows=14596 width=12)',),
 ('              ->  Hash  (cost=1.02..1.02 rows=2 width=4)',),
 ('                    ->  Seq Scan on staff st  (cost=0.00..1.02 rows=2 width=4)',)]

In [48]:
%%sql
SELECT  staff_id, payments.date, avg(payments.daily_payments) as avg_daily_payments
FROM    staff st JOIN (
            SELECT  staff_id
                    ,payment_date::TIMESTAMP::DATE as date
                    ,sum(amount) as daily_payments
            FROM    payment
            GROUP BY staff_id, date
        ) as payments
        USING(staff_id)
GROUP BY staff_id, date
ORDER BY payments.date, staff_id;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
64 rows affected.

[(1, datetime.date(2007, 2, 14), Decimal('45.9000000000000000')),
 (2, datetime.date(2007, 2, 14), Decimal('70.8300000000000000')),
 (1, datetime.date(2007, 2, 15), Decimal('599.3900000000000000')),
 (2, datetime.date(2007, 2, 15), Decimal('589.5300000000000000')),
 (1, datetime.date(2007, 2, 16), Decimal('611.5200000000000000')),
 (2, datetime.date(2007, 2, 16), Decimal('542.6600000000000000')),
 (1, datetime.date(2007, 2, 17), Decimal('527.7400000000000000')),
 (2, datetime.date(2007, 2, 17), Decimal('660.4300000000000000')),
 (1, datetime.date(2007, 2, 18), Decimal('662.3600000000000000')),
 (2, datetime.date(2007, 2, 18), Decimal('613.6200000000000000')),
 (1, datetime.date(2007, 2, 19), Decimal('659.3900000000000000')),
 (2, datetime.date(2007, 2, 19), Decimal('631.5100000000000000')),
 (1, datetime.date(2007, 2, 20), Decimal('606.5500000000000000')),
 (2, datetime.date(2007, 2, 20), Decimal('612.5400000000000000')),
 (1, datetime.date(2007, 2, 21), Decimal('447.9900000000000000')),
 (2, datetime.date(2007, 2, 21), Decimal('469.8800000000000000')),
 (1, datetime.date(2007, 3, 1), Decimal('1461.4500000000000000')),
 (2, datetime.date(2007, 3, 1), Decimal('1346.7900000000000000')),
 (1, datetime.date(2007, 3, 2), Decimal('1237.2100000000000000')),
 (2, datetime.date(2007, 3, 2), Decimal('1312.8400000000000000')),
 (1, datetime.date(2007, 3, 16), Decimal('112.7000000000000000')),
 (2, datetime.date(2007, 3, 16), Decimal('186.5800000000000000')),
 (1, datetime.date(2007, 3, 17), Decimal('1201.0400000000000000')),
 (2, datetime.date(2007, 3, 17), Decimal('1241.1200000000000000')),
 (1, datetime.date(2007, 3, 18), Decimal('1395.8000000000000000')),
 (2, datetime.date(2007, 3, 18), Decimal('1305.9600000000000000')),
 (1, datetime.date(2007, 3, 19), Decimal('1213.9800000000000000')),
 (2, datetime.date(2007, 3, 19), Decimal('1403.7100000000000000')),
 (1, datetime.date(2007, 3, 20), Decimal('1231.0900000000000000')),
 (2, datetime.date(2007, 3, 20), Decimal('1438.8000000000000000')),
 (1, datetime.date(2007, 3, 21), Decimal('1326.8500000000000000')),
 (2, datetime.date(2007, 3, 21), Decimal('1541.4200000000000000')),
 (1, datetime.date(2007, 3, 22), Decimal('1338.7000000000000000')),
 (2, datetime.date(2007, 3, 22), Decimal('1248.0900000000000000')),
 (1, datetime.date(2007, 3, 23), Decimal('1258.0100000000000000')),
 (2, datetime.date(2007, 3, 23), Decimal('1084.4200000000000000')),
 (1, datetime.date(2007, 4, 5), Decimal('136.7000000000000000')),
 (2, datetime.date(2007, 4, 5), Decimal('136.6600000000000000')),
 (1, datetime.date(2007, 4, 6), Decimal('1032.5700000000000000')),
 (2, datetime.date(2007, 4, 6), Decimal('1044.5700000000000000')),
 (1, datetime.date(2007, 4, 7), Decimal('1009.6300000000000000')),
 (2, datetime.date(2007, 4, 7), Decimal('974.6500000000000000')),
 (1, datetime.date(2007, 4, 8), Decimal('1066.4400000000000000')),
 (2, datetime.date(2007, 4, 8), Decimal('1161.4000000000000000')),
 (1, datetime.date(2007, 4, 9), Decimal('1001.4600000000000000')),
 (2, datetime.date(2007, 4, 9), Decimal('1066.4000000000000000')),
 (1, datetime.date(2007, 4, 10), Decimal('1037.4800000000000000')),
 (2, datetime.date(2007, 4, 10), Decimal('935.7000000000000000')),
 (1, datetime.date(2007, 4, 11), Decimal('947.6700000000000000')),
 (2, datetime.date(2007, 4, 11), Decimal('992.6500000000000000')),
 (1, datetime.date(2007, 4, 12), Decimal('911.7800000000000000')),
 (2, datetime.date(2007, 4, 12), Decimal('1018.7000000000000000')),
 (1, datetime.date(2007, 4, 26), Decimal('210.5400000000000000')),
 (2, datetime.date(2007, 4, 26), Decimal('136.6700000000000000')),
 (1, datetime.date(2007, 4, 27), Decimal('1370.7400000000000000')),
 (2, datetime.date(2007, 4, 27), Decimal('1302.8300000000000000')),
 (1, datetime.date(2007, 4, 28), Decimal('1237.9300000000000000')),
 (2, datetime.date(2007, 4, 28), Decimal('1384.8000000000000000')),
 (1, datetime.date(2007, 4, 29), Decimal('1328.7900000000000000')),
 (2, datetime.date(2007, 4, 29), Decimal('1388.8100000000000000')),
 (1, datetime.date(2007, 4, 30), Decimal('2788.6300000000000000')),
 (2, datetime.date(2007, 4, 30), Decimal('2935.2600000000000000')),
 (1, datetime.date(2007, 5, 14), Decimal('234.0900000000000000')),
 (2, datetime.date(2007, 5, 14), Decimal('280.0900000000000000'))]

### 6
### What is the statistical correlation between film length and rental rate?

In [49]:
%%sql
EXPLAIN
SELECT  corr(length, rental_rate)
FROM    film;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
2 rows affected.

[('Aggregate  (cost=71.50..71.51 rows=1 width=8)',),
 ('  ->  Seq Scan on film  (cost=0.00..64.00 rows=1000 width=8)',)]

In [50]:
%%sql
SELECT  corr(length, rental_rate)
FROM    film;

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
1 rows affected.

[(0.0297892586459086,)]

[Helpful Hints Video](https://youtu.be/3d2vgLn9KVs)

# Save your Notebook, then `File > Close and Halt`